prasetia9361/ESP32-INMP441-MAX98357-ESPNOW/lib/audio/audio.cpp
    i2s_driver_install(m_i2s_port, &i2s_mic_Config, 0, NULL);
    i2s_set_pin(m_i2s_port, &m_i2s_pins);
    i2s_zero_dma_buffer(m_i2s_port);

    i2s_start(m_i2s_port);
}

int audio::read(int16_t *samples, int count){
    size_t bytes_read = 0;
    // static int16_t prev_sample = 0;
    // const float alpha = 0.2; 
    if (count > m_raw_samples_size)
    {
        count = m_raw_samples_size;
    }
    i2s_read(m_i2s_port, m_raw_samples, count, &bytes_read, portMAX_DELAY);
    int samples_read = bytes_read / sizeof(int16_t);
    
    // Tambahkan amplifikasi ke sampel
    // const int16_t gain = 100; // Faktor amplifikasi, bisa disesuaikan (10x, 20x, 50x, 100x)
    
    for (int i = 0; i < samples_read; i++)
    {
        // Amplifikasi sinyal dengan gain dan batasi nilai ke INT16_MAX
        // int32_t amplified = (int32_t)m_raw_samples[i] * gain;
        
        // if (amplified > INT16_MAX) {
        //     samples[i] = INT16_MAX;
        // }
        // else if (amplified < -INT16_MAX) {
        //     samples[i] = -INT16_MAX;
        // }
        // else {
        //     samples[i] = (int16_t)amplified;
        // }

        // int32_t amplified = (int32_t)m_raw_samples[i] * gain;
        
        
        if (m_raw_samples[i] > INT16_MAX) {
            samples[i] = INT16_MAX;
        }
        else if (m_raw_samples[i] < -INT16_MAX) {
            samples[i] = -INT16_MAX;
        }
        // else if(abs(m_raw_samples[i]) < 50){
        //   samples[i] = 0;
        // }
        else {
            // samples[i] = alpha * m_raw_samples[i] + (1.0f - alpha) * prev_sample;
            // prev_sample = m_raw_samples[i];
            samples[i] = m_raw_samples[i];
        }

        // Serial.println(samples[i]);
    }
    return samples_read;
}


void audio::i2sTone(uint8_t _mode){
  // Update frequency berdasarkan mode
  float frequency;
  unsigned long currentMillis = millis();
  mode = _mode;
  switch (mode) {
    case 1:  //Wail
      {
        float t = (currentMillis % 5000) / 5000.0f;

        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

        frequency = 790 + 766 * pola;
      }
      break;

    case 2:  // Yelp
      {
        float t = (currentMillis % 400) / 400.0f;


        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 0.4f));

        frequency = 790 + 766 * pola;
      }
      break;

    case 3:  // Piercer
      {

        float t = (currentMillis % 60) / 60.0f;


        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 0.4f));

        frequency = 790 + 766 * pola;
      }
      break;

    case 4:  //HiLo
      {
        float t = (currentMillis % 1900) / 1900.0f;
        frequency = 614.5f + 53.5f * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 5:  // B-HiLo
      {
        float t = (currentMillis % 900) / 900.0f;
        frequency = 973 + 163 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 6:  //DIN-HiLo
      {
        float t = (currentMillis % 1500) / 1500.0f;
        frequency = 518.5f + 73.5f * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 7:  // AirHorn
      frequency = 430;

      break;

    case 8:  // Airhorn clasic
      frequency = 215;
      break;

    case 9:  //HiLo 446p
      {
        float t = (currentMillis % 1500) / 1500.0f;
        frequency = 555 + 75 * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 10:  //HiLo 500 - 660
      {
        float t = (currentMillis % 2000) / 2000.0f;

        frequency = 589 + 82 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 11:  //HiLo 510 - 1150
      {
        float t = (currentMillis % 700) / 700.0f;

        frequency = 830 + 320 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 12:  //HiLo 610 - 760
      {
        float t = (currentMillis % 1100) / 1100.0f;

        frequency = 685 + 75 * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 13:  //HiLo GEN
      {
        float t = (currentMillis % 1000) / 1000.0f;

        frequency = 600 + 155 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 14:  //HiLo POL
      {
        float t = (currentMillis % 1000) / 1000.0f;  // Siklus 2 detik
        // frekuensi high 510 low di 1150

        frequency = 518.5f + 73.5f * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 15:  //HiLo SPO
      {
        float t = (currentMillis % 2000) / 2000.0f;

        frequency = 471 + 26 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 16:  //HiLo UMH
      {
        float t = (currentMillis % 1000) / 1000.0f;

        frequency = 558 + 113 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 17:  // Warning chirp
      {
        unsigned long cycleTime = currentMillis % 800;
        float t = currentMillis % 200 / 200.0f;
        float pola = 2.0f * powf(2.0f * t, 2.0f);
        if (cycleTime <= 66) {
          frequency = 939 + 1079 * pola;
        } else {
          frequency = 0;
        }
      }
      break;

    case 18:  // Warning chirp
      {

        unsigned long cycleTime = currentMillis % 800;
        float t = cycleTime / 800.0f;
        if (cycleTime <= 66) {
          frequency = 1079 + 139 * sin(t * 24 * PI);
        } else {
          frequency = 0;
        }
      }
      break;

    case 19:  // K9 Alarm
      {

        unsigned long cycleTime = currentMillis % 700;
        float t = cycleTime / 700.0f;
        if (cycleTime <= 175) {
          frequency = 1079 + 139 * sin(t * 24 * PI);
        } else {
          frequency = 0;
        }
      }
      break;

    case 20:  // Wail - C
      {
        unsigned long cycleTime = currentMillis % 5000;
        float t = cycleTime / 5000.0f;

        if (cycleTime < 700) {
          float t = cycleTime / 700.0f;
          frequency = 907 + 687 * sin(M_PI * t / 2);
        } else if (cycleTime >= 700 && cycleTime < 4400) {
          frequency = 1594;
        } else {
          float t = (cycleTime - 4400) % 600 / 600.0f;
          frequency = 907 + 687 * (1 - sin(M_PI * t / 2));
        }
      }
      break;

