prasetia9361/ESP32-INMP441-MAX98357-ESPNOW/lib/audio/audio.cpp
    case 50:  // Austria Fire Tone
      {
        unsigned long cycleTime = currentMillis % 3500;

        if (cycleTime < 500) {
          frequency = 397;
        } else if (cycleTime >= 500 && cycleTime < 1500) {
          frequency = 532;
        } else if (cycleTime >= 1500 && cycleTime < 2000) {
          frequency = 397;
        } else if (cycleTime >= 2000 && cycleTime < 3100) {
          frequency = 532;
        } else {
          frequency = 0;
        }
      }
      break;

    case 51:  // Italy Ambulance
      {
        unsigned long cycleTime = currentMillis % 1500;
        if (cycleTime < 500) {
          float t = cycleTime % 300 / 300.0f;
          frequency = 533.5f + 136.5f * (sin(2 * M_PI * t) > 0 ? 1 : -1);
        } else {
          frequency = 397;
        }
      }
      break;

    case 52:  // 397 AVF
      {
        unsigned long cycleTime = currentMillis % 1500;
        if (cycleTime < 500) {
          float t = cycleTime % 300 / 300.0f;
          frequency = 533.5f + 136.5f * (sin(2 * M_PI * t) > 0 ? 1 : -1);
        } else {
          frequency = 397;
        }
      }
      break;

    case 53:  // FRA AF
      {
        unsigned long cycleTime = currentMillis % 1200;
        if (cycleTime < 190) {
          frequency = 431;
        } else if (cycleTime >= 190 && cycleTime < 360) {
          frequency = 532;
        } else if (cycleTime >= 360 && cycleTime < 500) {
          frequency = 424;
        } else {
          frequency = 0;
        }
      }
      break;

    case 54:  //Triton
      {
        unsigned long cycleTime = currentMillis % 3500;
        if (cycleTime < 900) {
          frequency = 641;
        } else if (cycleTime >= 900 && cycleTime < 1800) {
          frequency = 812;
        } else if (cycleTime >= 1800 && cycleTime < 2700) {
          frequency = 484;
        } else {
          frequency = 813;
        }
      }
      break;

    case 55:  // Holand Slow
      {
        float t = (currentMillis % 1000) / 1000.0f;

        frequency = 442.5f + 57.5f * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 56:  // Holand fast
      {
        float t = (currentMillis % 400) / 400.0f;

        frequency = 442.5f + 57.5f * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 57:  // comp HiLo 1800 1400 List
      {
        float t = (currentMillis % 1300) / 1300.0f;

        frequency = 350 + 50 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 58:  // COmposite Triton
      {
        unsigned long cycleTime = currentMillis % 3500;
        if (cycleTime < 900) {
          frequency = 434;
        } else if (cycleTime >= 900 && cycleTime < 1800) {
          frequency = 538;
        } else if (cycleTime >= 1800 && cycleTime < 2700) {
          frequency = 323;
        } else {
          frequency = 538;
        }
      }
      break;

    case 59:  // France Fire Tone
      {
        float t = (currentMillis % 2100) / 2100.0f;

        frequency = 470.5 + 26.5 * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 60:  // France SAMU Tone
      {
        float t = (currentMillis % 1100) / 1100.0f;

        frequency = 557 + 113 * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 61:  // France Police Tone
      {
        float t = (currentMillis % 1100) / 1100.0f;

        frequency = 518 + 74 * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 62:  // France Ambulance Tone
      {
        unsigned long cycleTime = currentMillis % 1200;
        if (cycleTime < 190) {
          frequency = 431;
        } else if (cycleTime >= 190 && cycleTime < 360) {
          frequency = 532;
        } else if (cycleTime >= 360 && cycleTime < 500) {
          frequency = 424;
        } else {
          frequency = 0;
        }
      }
      break;

    default:
      frequency = 0;
      break;
  }

  phase_step = (uint32_t)(frequency * (1UL << 24) * WAVE_TABLE_SIZE / SAMPLE_RATE);
}

const uint8_t audio::modeTableMap(int mode){
    static const uint8_t map[63] = {
      0, 0, 0, 0, 0, 0,  // Mode 0-5
      0, 3, 3, 0, 0,     // Mode 6-10
      0, 0, 0, 0, 0,     // Mode 11-15
      0, 0, 0, 0, 0,     // Mode 16-20
      0, 1, 1, 1, 0,     // Mode 21-25
      0, 0, 0, 0, 0,     // Mode 26-30
      0, 0, 0, 0, 0,     // Mode 31-35
      0, 0, 0, 0, 1,     // Mode 36-40
      2, 2, 2, 2, 1,     // Mode 41-45
      1, 3, 1, 2, 2,     // Mode 46-50
      2, 0, 0, 0, 3,     // Mode 51-55
      3, 1, 1, 2, 2,     // Mode 56-60
      2, 2               // Mode 61-62
    };

    return map[mode];

  }

void audio::generateSineWave() {
    uint32_t index = (phase_accumulator >> 24) & (WAVE_TABLE_SIZE - 1);

    // Pilih tabel berdasarkan mode lookup
    int16_t raw_sample;
    uint8_t table_type = (mode < 63) ? modeTableMap(mode) : 0;

    switch (table_type) {
      case 1:
        raw_sample = combine_table[index];
        break;
      case 2:
        raw_sample = tone_table[index];
        break;
      case 3:
        raw_sample = airhorn_table[index];
        break;
      default:
        raw_sample = wave_table[index];
        break;
    }

    // Apply volume
    int16_t scaled_sample = (int32_t(raw_sample) * vol * envelope) / (100 * 100);

    phase_accumulator += phase_step;

    int16_t buffer[2] = { scaled_sample, scaled_sample };

    size_t bytes_written;
    i2s_write(I2S_NUM_0, buffer, sizeof(buffer), &bytes_written, portMAX_DELAY);

}